ua1arn/hftrx/lib/Middlewares/ST/STM32_USB_Host_Library/Class/MSC/Src/usbh_msc.c
  }
  return error;
}

/**
  * @brief  USBH_MSC_IsReady
  *         The function check if the MSC function is ready
  * @param  phost: Host handle
  * @retval USBH Status
  */
uint8_t  USBH_MSC_IsReady(USBH_HandleTypeDef *phost)
{

	if ((phost->device.is_connected == 0U) || (phost->gState != HOST_CLASS))
	{
		return 0;
	}

	if (phost->pActiveClass == NULL || phost->pActiveClass->pData == NULL)
	{
		return 0;
	}
	MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef*) phost->pActiveClass->pData;
	uint8_t res;

	if ((phost->gState == HOST_CLASS) && (MSC_Handle->state == MSC_IDLE))
	{
		res = 1U;
	}
	else
	{
		res = 0U;
	}

	return res;
}

/**
  * @brief  USBH_MSC_GetMaxLUN
  *         The function return the Max LUN supported
  * @param  phost: Host handle
  * @retval logical Unit Number supported
  */
uint8_t  USBH_MSC_GetMaxLUN(USBH_HandleTypeDef *phost)
{

	if ((phost->device.is_connected == 0U) || (phost->gState != HOST_CLASS))
	{
		return 0xFFU;
	}

	if (phost->pActiveClass == NULL || phost->pActiveClass->pData == NULL)
	{
		return 0xFFU;
	}

	MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef*) phost->pActiveClass->pData;

	if ((phost->gState == HOST_CLASS) && (MSC_Handle->state == MSC_IDLE))
	{
		return (uint8_t) MSC_Handle->max_lunv [0];
	}

	return 0xFFU;
}

/**
  * @brief  USBH_MSC_UnitIsReady
  *         The function check whether a LUN is ready
  * @param  phost: Host handle
  * @param  lun: logical Unit Number
  * @retval Lun status (0: not ready / 1: ready)
  */
uint8_t  USBH_MSC_UnitIsReady(USBH_HandleTypeDef *phost, uint8_t lun)
{

	if ((phost->device.is_connected == 0U) || (phost->gState != HOST_CLASS))
	{
		return 0;
	}

	if (phost->pActiveClass == NULL || phost->pActiveClass->pData == NULL)
	{
		return 0;
	}

	MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef*) phost->pActiveClass->pData;
	uint8_t res;

	if ((phost->gState == HOST_CLASS) && (MSC_Handle->unit [lun].error == MSC_OK))
	{
		res = 1U;
	}
	else
	{
		res = 0U;
	}

	return res;
}

/**
  * @brief  USBH_MSC_GetLUNInfo
  *         The function return a LUN information
  * @param  phost: Host handle
  * @param  lun: logical Unit Number
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_MSC_GetLUNInfo(USBH_HandleTypeDef *phost, uint8_t lun, MSC_LUNTypeDef *info)
{

	if ((phost->device.is_connected == 0U) || (phost->gState != HOST_CLASS))
	{
		return USBH_FAIL;
	}

	if (phost->pActiveClass == NULL || phost->pActiveClass->pData == NULL)
	{
		return USBH_FAIL;
	}

	MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef*) phost->pActiveClass->pData;
	if (phost->gState == HOST_CLASS)
	{
		(void) USBH_memcpy(info, & MSC_Handle->unit [lun], sizeof(MSC_LUNTypeDef));
		return USBH_OK;
	}
	else
	{
		return USBH_FAIL;
	}
}

/**
  * @brief  USBH_MSC_Read
  *         The function performs a Read operation
  * @param  phost: Host handle
  * @param  lun: logical Unit Number
  * @param  address: sector address
  * @param  pbuf: pointer to data
  * @param  length: number of sector to read
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_MSC_Read(USBH_HandleTypeDef *phost,
                                 uint8_t lun,
                                 uint32_t address,
                                 uint8_t *pbuf,
                                 uint32_t length)
{
	uint32_t timeout;

	if ((phost->device.is_connected == 0U) || (phost->gState != HOST_CLASS))
	{
		return USBH_FAIL;
	}

	if (phost->pActiveClass == NULL || phost->pActiveClass->pData == NULL) {
		return USBH_FAIL;
	}

	MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef*) phost->pActiveClass->pData;
	if (MSC_Handle->unit [lun].state != MSC_IDLE)
	{
		return USBH_FAIL;
	}

	MSC_Handle->state = MSC_READ;
	MSC_Handle->unit [lun].state = MSC_READ;
	MSC_Handle->rw_lun = lun;

	(void) USBH_MSC_SCSI_Read10(phost, lun, address, pbuf, length);

	timeout = phost->Timer;

	while (USBH_MSC_RdWrProcess(phost, lun) == USBH_BUSY)
	{
		if (((phost->Timer - timeout) > (TIMERFRAMES(10000U) * length)) || (phost->device.is_connected == 0U))
		{
			MSC_Handle->state = MSC_IDLE;
			return USBH_FAIL;
		}
	}
	MSC_Handle->state = MSC_IDLE;

	return USBH_OK;
}

/**
  * @brief  USBH_MSC_Write
  *         The function performs a Write operation
  * @param  phost: Host handle
  * @param  lun: logical Unit Number
  * @param  address: sector address
  * @param  pbuf: pointer to data
  * @param  length: number of sector to write
  * @retval USBH Status
  */
USBH_StatusTypeDef USBH_MSC_Write(USBH_HandleTypeDef *phost,
                                  uint8_t lun,
                                  uint32_t address,
                                  uint8_t *pbuf,
                                  uint32_t length)
{
//	if (length != 1)
//	{
//	    PRINTF("USBH_MSC_Write: pbuf=%p, address=%lu, length=%u\n", pbuf, (unsigned long) address, (unsigned) length);
//	}
	uint32_t timeout;

	if ((phost->device.is_connected == 0U) || (phost->gState != HOST_CLASS))
	{
		return USBH_FAIL;
	}

	if (phost->pActiveClass == NULL || phost->pActiveClass->pData == NULL) {
		return USBH_FAIL;
	}

	MSC_HandleTypeDef *MSC_Handle = (MSC_HandleTypeDef*) phost->pActiveClass->pData;
	if (MSC_Handle->unit [lun].state != MSC_IDLE)
	{
		return USBH_FAIL;
	}

	MSC_Handle->state = MSC_WRITE;
	MSC_Handle->unit [lun].state = MSC_WRITE;
	MSC_Handle->rw_lun = lun;

	(void) USBH_MSC_SCSI_Write10(phost, lun, address, pbuf, length);

	timeout = phost->Timer;
	while (USBH_MSC_RdWrProcess(phost, lun) == USBH_BUSY)
	{
		if (((phost->Timer - timeout) > (TIMERFRAMES(10000U) * length)) || (phost->device.is_connected == 0U))
		{
			MSC_Handle->state = MSC_IDLE;
			return USBH_FAIL;
		}
	}
	MSC_Handle->state = MSC_IDLE;
	return USBH_OK;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
#endif /* WITHUSBHW */
